const MIN_NUMBER = 10;
const MAX_SUSA = 1000000000000;
const MAX_NUM_KR = 10000;

const SUSA = {
  1: "하나",
  2: "둘",
  3: "셋",
  4: "넷",
  5: "다섯",
  6: "여섯",
  7: "일곱",
  8: "여덟",
  9: "아홉",
  10: "열",
  20: "스물",
  30: "서른",
  40: "마흔",
  50: "쉰",
  60: "예순",
  70: "일흔",
  80: "여든",
  90: "아흔",
  100: "백",
  1000: "천",
  10000: "만",
  100000000: "억",
  1000000000000: "조",
};

const NUM_KR = {
  1: "일",
  2: "이",
  3: "삼",
  4: "사",
  5: "오",
  6: "육",
  7: "칠",
  8: "팔",
  9: "구",
  10: "십",
  100: "백",
  1000: "천",
};

module.exports = { SUSA, MAX_NUM_KR, MAX_SUSA, MIN_NUMBER, NUM_KR };
